{
  "posts": [
    {
      "userId": 1,
      "id": 1,
      "title": "Як створити ефективні запити до бази даних в JavaScript",
      "body": "При розробці веб-додатків важливо знати, як ефективно взаємодіяти з базою даних. В статті розглядаються підходи до створення оптимальних запитів до бази даних за допомогою JavaScript та інших технологій."
    },
    {
      "userId": 1,
      "id": 2,
      "title": "Огляд найновіших трендів у розробці програмного забезпечення",
      "body": "ІТ-індустрія постійно змінюється, і нові тренди з'являються в розробці програмного забезпечення. У цій статті розглядаються ключові напрямки розвитку, такі як розширена реальність, штучний інтелект та мікросервісна архітектура."
    },
    {
      "userId": 1,
      "id": 3,
      "title": "5 корисних порад щодо оптимізації веб-сайту",
      "body": "Швидкість та продуктивність веб-сайту грають важливу роль у залученні користувачів. У цій статті розглядаються п'ять корисних порад щодо оптимізації завантаження сторінок, зменшення часу відгуку та покращення загальної взаємодії з користувачами."
    },
    {
      "userId": 1,
      "id": 4,
      "title": "Вступ до розробки ігор за допомогою JavaScript",
      "body": "JavaScript може бути потужним інструментом для створення власних веб-ігор. У цій статті розглядаються основні принципи розробки ігор, включаючи анімацію, обробку подій та роботу з графікою."
    },
    {
      "userId": 1,
      "id": 5,
      "title": "Як забезпечити безпеку мережі: основні кроки",
      "body": "Забезпечення безпеки мережі є критично важливим завданням для будь-якого ІТ-спеціаліста. У цій статті розглядаються основні кроки, які допоможуть забезпечити конфіденційність даних та запобігти кібератакам."
    },
    {
      "userId": 1,
      "id": 6,
      "title": "Розгортання додатків за допомогою контейнерів Docker",
      "body": "Docker є популярним інструментом для розгортання додатків у контейнерах, що забезпечує їх ізольованість та переносимість. У цій статті детально розглядається процес створення, налаштування та розгортання контейнерів Docker."
    },
    {
      "userId": 1,
      "id": 7,
      "title": "Як вибрати найкращий фреймворк для фронтенд-розробки",
      "body": "Незалежно від того, чи ви новачок у фронтенд-розробці, чи досвідчений веб-розробник, вибір правильного фреймворка може вплинути на продуктивність та якість вашого проекту. У цій статті розглядаються ключові фактори вибору та популярні фреймворки."
    },
    {
      "userId": 2,
      "id": 8,
      "title": "Оптимізація продуктивності веб-додатків з використанням React",
      "body": "React - це один з найпопулярніших фреймворків для розробки фронтенду. У статті розглядаються підходи до оптимізації продуктивності веб-додатків за допомогою React, такі як використання мемоізації, ліниве завантаження та інші техніки."
    },
    {
      "userId": 2,
      "id": 9,
      "title": "Використання REST API в програмуванні",
      "body": "REST (Representational State Transfer) - це архітектурний стиль для взаємодії між розподіленими системами. У статті детально розглядаються принципи та практичні аспекти використання REST API в програмуванні."
    },
    {
      "userId": 2,
      "id": 10,
      "title": "Основи алгоритмів та структур даних",
      "body": "Розуміння алгоритмів та структур даних є ключовим для розробки ефективних програм. У статті розглядаються основні поняття, такі як сортування, пошук, стеки, черги та інші структури даних."
    },
    {
      "userId": 2,
      "id": 11,
      "title": "Розробка мобільних додатків з використанням React Native",
      "body": "React Native дозволяє розробляти мобільні додатки для iOS та Android за допомогою JavaScript. У цій статті розглядаються переваги використання React Native, процес розробки та відладки мобільних додатків."
    },
    {
      "userId": 2,
      "id": 12,
      "title": "Шаблони проектування в програмуванні",
      "body": "Шаблони проектування - це відповідно структуровані підходи до вирішення типових задач у програмуванні. У статті розглядаються різні шаблони проектування та їх використання для покращення архітектури додатків."
    },
    {
      "userId": 3,
      "id": 13,
      "title": "Штучний інтелект у веб-розробці",
      "body": "Штучний інтелект (ШІ) відіграє все більш важливу роль у веб-розробці. У статті розглядаються застосування ШІ, такі як рекомендаційні системи, обробка природної мови та візуальне розпізнавання."
    },
    {
      "userId": 3,
      "id": 14,
      "title": "Основи криптографії та кібербезпеки",
      "body": "Кібербезпека є критично важливою для захисту даних та інформації в сучасному світі. У статті розглядаються основи криптографії, шифрування та заходи для забезпечення кібербезпеки."
    },
    {
      "userId": 3,
      "id": 15,
      "title": "Розробка інтерфейсів користувача з використанням HTML та CSS",
      "body": "HTML та CSS є основами веб-розробки і використовуються для створення інтерфейсів користувача. У статті розглядаються техніки створення адаптивних та привабливих веб-інтерфейсів."
    },
    {
      "userId": 3,
      "id": 16,
      "title": "Як використовувати Git для контролю версій",
      "body": "Git є популярною системою контролю версій, яка дозволяє зберігати та відстежувати зміни у коді. У статті розглядаються основи використання Git, команди та робочий процес розробників."
    },
    {
      "userId": 4,
      "id": 17,
      "title": "Паттерни проектування у Java",
      "body": "Паттерни проектування - це відповідно структуровані підходи до вирішення типових задач у програмуванні. У статті розглядаються різні паттерни проектування та їх використання в мові програмування Java."
    },
    {
      "userId": 4,
      "id": 18,
      "title": "Тестування програмного забезпечення: основні принципи",
      "body": "Тестування програмного забезпечення - це важлива частина розробки, яка допомагає забезпечити якість та надійність продукту. У статті розглядаються основні види тестування та принципи його проведення."
    },
    {
      "userId": 4,
      "id": 19,
      "title": "Як створити власний веб-сервер на Node.js",
      "body": "Node.js - це платформа, яка дозволяє розробникам створювати серверні додатки на JavaScript. У статті розглядається процес створення веб-сервера на Node.js та взаємодія з ним за допомогою HTTP-запитів."
    },
    {
      "userId": 4,
      "id": 20,
      "title": "Принципи рефакторінгу коду",
      "body": "Рефакторінг - це процес поліпшення структури та якості коду без зміни його функціональності. У статті розглядаються ключові принципи рефакторінгу та популярні методики."
    },
    {
      "userId": 5,
      "id": 21,
      "title": "Автоматизація тестування з використанням Selenium",
      "body": "Selenium - це інструмент для автоматизації тестування веб-додатків. У статті розглядаються підходи до створення та виконання автоматизованих тестів з використанням Selenium."
    },
    {
      "userId": 5,
      "id": 22,
      "title": "Способи оптимізації завантаження веб-сторінок",
      "body": "Швидкість завантаження веб-сторінок має велике значення для користувачів. У статті розглядаються різні способи оптимізації завантаження, включаючи стиснення зображень, кешування та асинхронне завантаження ресурсів."
    },
    {
      "userId": 5,
      "id": 23,
      "title": "Створення анімацій з CSS та JavaScript",
      "body": "Анімації можуть зробити веб-сайт більш привабливим та динамічним. У статті розглядаються методи створення анімацій з використанням CSS-переходів та JavaScript-бібліотек."
    },
    {
      "userId": 5,
      "id": 24,
      "title": "Підходи до тестування безпеки веб-додатків",
      "body": "Тестування безпеки - важлива складова розробки веб-додатків. У статті розглядаються підходи до тестування на вразливості та заходи для забезпечення безпеки даних."
    },
    {
      "userId": 5,
      "id": 25,
      "title": "Основи асинхронного програмування в JavaScript",
      "body": "Асинхронне програмування - це підхід, який дозволяє виконувати нечекаючі дії та забезпечує більш високу продуктивність додатків. У статті розглядаються основні концепції та методики асинхронного програмування в JavaScript."
    },
    {
      "userId": 6,
      "id": 26,
      "title": "Розробка ігор на Unity: від ідеї до релізу",
      "body": "Unity - популярний інструмент для розробки ігор у 2D та 3D форматах. У статті розглядається процес створення власної гри на Unity, від концепції до випуску."
    },
    {
      "userId": 6,
      "id": 27,
      "title": "Створення відомих веб-сайтів на WordPress",
      "body": "WordPress - платформа для створення веб-сайтів та блогів. У статті розглядаються практичні кроки створення власного веб-сайту на базі WordPress."
    },
    {
      "userId": 6,
      "id": 28,
      "title": "Як використовувати API Google Maps у веб-додатках",
      "body": "API Google Maps дозволяє інтегрувати карти та геолокацію у веб-додатки. У статті розглядається використання API Google Maps для відображення мап та реалізації функціональності зв'язаної з місцезнаходженням."
    },
    {
      "userId": 6,
      "id": 29,
      "title": "Способи оптимізації веб-додатків для мобільних пристроїв",
      "body": "Веб-додатки повинні працювати ефективно та зручно на мобільних пристроях. У статті розглядаються підходи до оптимізації веб-додатків для мобільних платформ."
    },
    {
      "userId": 7,
      "id": 30,
      "title": "Штучний інтелект у медичній діагностиці",
      "body": "Штучний інтелект знаходить застосування у різних галузях, включаючи медичну діагностику. У статті розглядаються приклади використання ШІ для покращення точності діагностики та лікування."
    },
    {
      "userId": 7,
      "id": 31,
      "title": "Створення ефективних запитів до API за допомогою GraphQL",
      "body": "GraphQL - це мова запитів для API, яка дозволяє отримувати лише необхідні дані. У статті розглядаються переваги використання GraphQL та основні принципи створення запитів."
    },
    {
      "userId": 7,
      "id": 32,
      "title": "Робототехніка: від теорії до практики",
      "body": "Робототехніка - це галузь, яка досліджує створення та використання роботів. У статті розглядаються основи робототехніки та приклади практичних застосувань."
    },
    {
      "userId": 7,
      "id": 33,
      "title": "Секрети успішної командної роботи в програмуванні",
      "body": "Робота у команді важлива для досягнення високої продуктивності та якості. У статті розглядаються секрети успішної командної роботи у програмуванні, включаючи розподіл завдань, спільний код та зворотний зв'язок."
    },
    {
      "userId": 7,
      "id": 34,
      "title": "Основи розробки розширень для браузерів",
      "body": "Розширення для браузерів дозволяють розширити функціональність веб-переглядача. У статті розглядаються основи розробки розширень для популярних браузерів, таких як Chrome та Firefox."
    },
    {
      "userId": 8,
      "id": 35,
      "title": "Як створити власний блог на платформі Ghost",
      "body": "Ghost - платформа для створення та управління власним блогом. У статті розглядаються кроки створення та налаштування власного блогу на платформі Ghost."
    },
    {
      "userId": 8,
      "id": 36,
      "title": "Оптимізація баз даних для високої продуктивності",
      "body": "Ефективна робота з базами даних важлива для продуктивності додатків. У статті розглядаються методи оптимізації баз даних для забезпечення високої продуктивності та відгуку."
    },
    {
      "userId": 8,
      "id": 37,
      "title": "Створення адаптивних макетів з використанням CSS Grid",
      "body": "CSS Grid - це потужний інструмент для створення адаптивних макетів. У статті розглядаються принципи створення адаптивних макетів з використанням CSS Grid."
    },
    {
      "userId": 8,
      "id": 38,
      "title": "Як створити додаток з використанням Electron",
      "body": "Electron дозволяє розробникам створювати крос-платформені додатки на базі веб-технологій. У статті розглядається процес створення додатка з використанням Electron."
    },
    {
      "userId": 8,
      "id": 39,
      "title": "Основи роботи з Docker для розробників",
      "body": "Docker дозволяє розробникам створювати, розгортати та управляти контейнерами. У статті розглядаються основи роботи з Docker, включаючи створення образів та контейнерів."
    },
    {
      "userId": 8,
      "id": 40,
      "title": "Як створити чат-додаток з використанням WebSocket",
      "body": "WebSocket - це технологія для реалізації двостороннього зв'язку між клієнтом та сервером. У статті розглядається процес створення чат-додатка з використанням WebSocket."
    },
    {
      "userId": 9,
      "id": 41,
      "title": "Використання Redux для керування станом додатків",
      "body": "Redux є популярною бібліотекою для керування станом додатків. У статті розглядаються основи використання Redux та практичні приклади його застосування."
    },
    {
      "userId": 9,
      "id": 42,
      "title": "Основи тестування розробки на React",
      "body": "Тестування є важливою складовою розробки на React. У статті розглядаються основні підходи до тестування компонентів та додатків на React."
    },
    {
      "userId": 9,
      "id": 43,
      "title": "Архітектурні підходи у веб-розробці: MVC, MVP, MVVM",
      "body": "Розробка веб-додатків вимагає вибору відповідної архітектури. У статті розглядаються популярні архітектурні підходи, такі як MVC, MVP та MVVM, та їх вплив на організацію коду."
    },
    {
      "userId": 9,
      "id": 44,
      "title": "Принципи розробки масштабованих систем",
      "body": "Масштабованість є важливою якістю системи. У статті розглядаються принципи розробки масштабованих систем, включаючи горизонтальне та вертикальне масштабування."
    },
    {
      "userId": 9,
      "id": 45,
      "title": "Основи роботи з API та HTTP-запитами",
      "body": "Взаємодія між додатками часто здійснюється за допомогою API та HTTP-запитів. У статті розглядаються основи роботи з API, види запитів та обробка відповідей."
    },
    {
      "userId": 10,
      "id": 46,
      "title": "Оптимізація баз даних для аналітики",
      "body": "Бази даних відіграють важливу роль у зборі та аналізі даних. У статті розглядаються підходи до оптимізації баз даних для забезпечення ефективної аналітики."
    },
    {
      "userId": 10,
      "id": 47,
      "title": "Підходи до безпеки даних в хмарних сервісах",
      "body": "Хмарні сервіси надають зручність та доступність для зберігання даних. У статті розглядаються підходи до забезпечення безпеки даних у хмарних сервісах."
    },
    {
      "userId": 10,
      "id": 48,
      "title": "Як використовувати аутентифікацію та авторизацію в додатках",
      "body": "Аутентифікація та авторизація - важливі аспекти забезпечення безпеки додатків. У статті розглядаються методи та практики використання аутентифікації та авторизації."
    },
    {
      "userId": 10,
      "id": 49,
      "title": "Основи розробки ігор на HTML5 та JavaScript",
      "body": "HTML5 та JavaScript дозволяють розробляти власні ігри для веб-браузерів. У статті розглядаються основи розробки ігор на HTML5 та JavaScript."
    },
    {
      "userId": 10,
      "id": 50,
      "title": "Як створити ефективний інтерфейс користувача",
      "body": "Ефективний інтерфейс користувача є ключем до зручності та задоволення користувачів. У статті розглядаються принципи створення ефективного інтерфейсу користувача."
    }
  ],
  "todos": [
    {
      "userId": 1,
      "id": 1,
      "title": "Вивчити основи алгоритміки",
      "completed": false
    },
    {
      "userId": 1,
      "id": 2,
      "title": "Написати функцію сортування на JavaScript",
      "completed": false
    },
    {
      "userId": 1,
      "id": 3,
      "title": "Дослідити можливості використання штучного інтелекту в розробці",
      "completed": false
    },
    {
      "userId": 1,
      "id": 4,
      "title": "Створити анімаційний ефект на веб-сайті",
      "completed": true
    },
    {
      "userId": 1,
      "id": 5,
      "title": "Вивчити принципи роботи Docker",
      "completed": false
    },
    {
      "userId": 1,
      "id": 6,
      "title": "Розробити REST API для додатку",
      "completed": false
    },
    {
      "userId": 1,
      "id": 7,
      "title": "Оптимізувати запити до бази даних",
      "completed": false
    },
    {
      "userId": 2,
      "id": 8,
      "title": "Написати скрипт для автоматизації рутинних завдань",
      "completed": true
    },
    {
      "userId": 2,
      "id": 9,
      "title": "Вивчити нові можливості ES2022",
      "completed": false
    },
    {
      "userId": 2,
      "id": 10,
      "title": "Розробити власний інтерфейс користувача на React",
      "completed": true
    },
    {
      "userId": 2,
      "id": 11,
      "title": "Дослідити криптовалюти та блокчейн технології",
      "completed": true
    },
    {
      "userId": 2,
      "id": 12,
      "title": "Написати статтю про переваги використання GraphQL",
      "completed": true
    },
    {
      "userId": 2,
      "id": 13,
      "title": "Вивчити основи мережевої безпеки",
      "completed": false
    },
    {
      "userId": 2,
      "id": 14,
      "title": "Створити додаток для IoT пристрою",
      "completed": true
    },
    {
      "userId": 2,
      "id": 15,
      "title": "Оптимізувати веб-додаток для високої швидкості завантаження",
      "completed": true
    },
    {
      "userId": 3,
      "id": 16,
      "title": "Розробити алгоритм розпізнавання об'єктів на зображеннях",
      "completed": true
    },
    {
      "userId": 3,
      "id": 17,
      "title": "Навчитися робити резервні копії баз даних",
      "completed": true
    },
    {
      "userId": 3,
      "id": 18,
      "title": "Розробити власний фреймворк для веб-додатків",
      "completed": false
    },
    {
      "userId": 3,
      "id": 19,
      "title": "Вивчити основи машинного навчання",
      "completed": true
    },
    {
      "userId": 3,
      "id": 20,
      "title": "Дослідити можливості використання WebAssembly",
      "completed": true
    },
    {
      "userId": 3,
      "id": 21,
      "title": "Розробити адаптивний дизайн для веб-сайту",
      "completed": false
    },
    {
      "userId": 3,
      "id": 22,
      "title": "Написати тестові сценарії для додатку",
      "completed": true
    },
    {
      "userId": 4,
      "id": 23,
      "title": "Вивчити принципи роботи HTTP/2",
      "completed": false
    },
    {
      "userId": 4,
      "id": 24,
      "title": "Створити інтерактивну анімацію на SVG",
      "completed": false
    },
    {
      "userId": 4,
      "id": 25,
      "title": "Навчитися використовувати контейнери в Kubernetes",
      "completed": true
    },
    {
      "userId": 4,
      "id": 26,
      "title": "Налаштувати інтеграцію з GitHub Actions для автоматичного тестування",
      "completed": false
    },
    {
      "userId": 4,
      "id": 27,
      "title": "Розробити функціонал автентифікації для додатку",
      "completed": true
    },
    {
      "userId": 4,
      "id": 28,
      "title": "Оптимізувати завантаження сторінок в React додатку",
      "completed": false
    },
    {
      "userId": 4,
      "id": 29,
      "title": "Навчитися використовувати Redux для управління станом додатку",
      "completed": true
    },
    {
      "userId": 4,
      "id": 30,
      "title": "Створити додаток для автоматичного аналізу тексту на наявність ключових слів",
      "completed": false
    },
    {
      "userId": 5,
      "id": 31,
      "title": "Дослідити можливості використання WebRTC для реалізації відеодзвінків у веб-додатку",
      "completed": false
    },
    {
      "userId": 5,
      "id": 32,
      "title": "Розробити адміністративний розділ для веб-додатку",
      "completed": true
    },
    {
      "userId": 5,
      "id": 33,
      "title": "Оптимізувати SQL-запити для покращення продуктивності",
      "completed": false
    },
    {
      "userId": 5,
      "id": 34,
      "title": "Написати інструкцію для встановлення та запуску додатку",
      "completed": true
    },
    {
      "userId": 5,
      "id": 35,
      "title": "Дослідити можливості використання PWA для покращення досвіду користувачів",
      "completed": true
    },
    {
      "userId": 5,
      "id": 36,
      "title": "Створити анімацію логотипу для веб-сайту",
      "completed": false
    },
    {
      "userId": 6,
      "id": 37,
      "title": "Вивчити основи роботи з Docker Compose",
      "completed": true
    },
    {
      "userId": 6,
      "id": 38,
      "title": "Розробити функціонал сповіщень для мобільного додатку",
      "completed": false
    },
    {
      "userId": 6,
      "id": 39,
      "title": "Оптимізувати відображення даних на веб-сайті за допомогою віртуальних списків",
      "completed": true
    },
    {
      "userId": 6,
      "id": 40,
      "title": "Навчитися використовувати GraphQL для оптимізації запитів до сервера",
      "completed": true
    },
    {
      "userId": 6,
      "id": 41,
      "title": "Дослідити методи захисту від CSRF-атак",
      "completed": true
    },
    {
      "userId": 6,
      "id": 42,
      "title": "Розробити інструмент для автоматичного перевірки коду на відповідність стандартам",
      "completed": false
    },
    {
      "userId": 6,
      "id": 43,
      "title": "Вивчити принципи роботи Quantum Computing",
      "completed": false
    },
    {
      "userId": 6,
      "id": 44,
      "title": "Написати статтю про переваги використання контейнерів у розробці",
      "completed": true
    },
    {
      "userId": 6,
      "id": 45,
      "title": "Дослідити можливості використання біг даних (Big Data) в аналізі даних",
      "completed": true
    },
    {
      "userId": 7,
      "id": 46,
      "title": "Розробити ігровий додаток для навчання програмування",
      "completed": false
    },
    {
      "userId": 7,
      "id": 47,
      "title": "Навчитися використовувати архітектурний паттерн MVC",
      "completed": true
    },
    {
      "userId": 7,
      "id": 48,
      "title": "Створити додаток для обробки та аналізу зображень",
      "completed": false
    },
    {
      "userId": 7,
      "id": 49,
      "title": "Дослідити принципи роботи квантових комп'ютерів",
      "completed": true
    },
    {
      "userId": 7,
      "id": 50,
      "title": "Вивчити основи розробки плагінів для IDE",
      "completed": true
    },
    {
      "userId": 8,
      "id": 51,
      "title": "Розробити власний редактор коду",
      "completed": false
    },
    {
      "userId": 8,
      "id": 52,
      "title": "Оптимізувати SQL-запити для покращення продуктивності",
      "completed": true
    },
    {
      "userId": 8,
      "id": 53,
      "title": "Дослідити технології віртуалізації серверів",
      "completed": false
    },
    {
      "userId": 8,
      "id": 54,
      "title": "Написати скрипт для генерації тестових даних",
      "completed": false
    },
    {
      "userId": 8,
      "id": 55,
      "title": "Вивчити архітектурні патерни програмування",
      "completed": true
    },
    {
      "userId": 8,
      "id": 56,
      "title": "Реалізувати систему кешування для веб-додатка",
      "completed": false
    },
    {
      "userId": 8,
      "id": 57,
      "title": "Дослідити методи захисту від SQL-ін'єкцій",
      "completed": false
    },
    {
      "userId": 8,
      "id": 58,
      "title": "Розробити мобільний додаток з використанням React Native",
      "completed": true
    },
    {
      "userId": 8,
      "id": 59,
      "title": "Створити додаток для відстеження робочого часу",
      "completed": false
    },
    {
      "userId": 9,
      "id": 60,
      "title": "Навчитися використовувати контейнери Docker",
      "completed": true
    },
    {
      "userId": 9,
      "id": 61,
      "title": "Дослідити методи тестування безпеки веб-додатків",
      "completed": true
    },
    {
      "userId": 9,
      "id": 62,
      "title": "Написати скрипт для резервного копіювання файлів",
      "completed": true
    },
    {
      "userId": 9,
      "id": 63,
      "title": "Вивчити асинхронне програмування на Node.js",
      "completed": false
    },
    {
      "userId": 9,
      "id": 64,
      "title": "Розробити ігровий двигун для власної гри",
      "completed": true
    },
    {
      "userId": 9,
      "id": 65,
      "title": "Створити додаток для аналізу даних за допомогою Python",
      "completed": true
    },
    {
      "userId": 9,
      "id": 66,
      "title": "Дослідити принципи роботи блокчейну Ethereum",
      "completed": true
    },
    {
      "userId": 9,
      "id": 67,
      "title": "Написати скрипт для автоматичного оновлення додатку",
      "completed": true
    },
    {
      "userId": 10,
      "id": 68,
      "title": "Вивчити розробку розширень для веб-браузерів",
      "completed": false
    },
    {
      "userId": 10,
      "id": 69,
      "title": "Розробити систему автоматичного тестування",
      "completed": true
    },
    {
      "userId": 10,
      "id": 70,
      "title": "Дослідити використання інтернету речей (IoT) у побуті",
      "completed": true
    },
    {
      "userId": 10,
      "id": 71,
      "title": "Створити веб-сервіс для обміну криптовалют",
      "completed": false
    },
    {
      "userId": 10,
      "id": 72,
      "title": "Навчитися використовувати Gatsby для створення швидких веб-сайтів",
      "completed": true
    },
    {
      "userId": 10,
      "id": 73,
      "title": "Дослідити можливості використання GraphQL у мобільних додатках",
      "completed": false
    },
    {
      "userId": 10,
      "id": 74,
      "title": "Написати скрипт для автоматичного тестування інтерфейсу",
      "completed": false
    },
    {
      "userId": 10,
      "id": 75,
      "title": "Вивчити принципи роботи Quantum Computing",
      "completed": true
    }
  ],
  "users": [
    {
      "id": 1,
      "name": "Марія Іваненко",
      "username": "MaryIva",
      "email": "maria.ivanenko@example.com",
      "address": {
        "street": "вул. Шевченка",
        "suite": "кв. 15",
        "city": "Київ",
        "zipcode": "03022",
        "geo": {
          "lat": "50.4501",
          "lng": "30.5234"
        }
      },
      "phone": "044-123-4567",
      "website": "mariiva.com",
      "company": {
        "name": "Техносервіс",
        "catchPhrase": "Розробка інноваційних рішень",
        "bs": "ефективність та надійність"
      }
    },
    {
      "id": 2,
      "name": "Олег Петров",
      "username": "OlegPetr",
      "email": "oleg.petrov@example.com",
      "address": {
        "street": "вул. Гагаріна",
        "suite": "кв. 7",
        "city": "Львів",
        "zipcode": "79000",
        "geo": {
          "lat": "49.8397",
          "lng": "24.0297"
        }
      },
      "phone": "032-987-6543",
      "website": "olegpetr.ua",
      "company": {
        "name": "SoftTech",
        "catchPhrase": "Інновації у розробці програмного забезпечення",
        "bs": "сучасні технології та креативність"
      }
    },
    {
      "id": 3,
      "name": "Наталія Коваленко",
      "username": "NataliaKov",
      "email": "natalia.kovalenko@example.com",
      "address": {
        "street": "вул. Січових Стрільців",
        "suite": "кв. 23",
        "city": "Харків",
        "zipcode": "61000",
        "geo": {
          "lat": "49.9935",
          "lng": "36.2304"
        }
      },
      "phone": "057-765-4321",
      "website": "nataliakov.ua",
      "company": {
        "name": "TechInnovate",
        "catchPhrase": "Перетворюємо ідеї в реальність",
        "bs": "творчий підхід до розробки"
      }
    },
    {
      "id": 4,
      "name": "Андрій Семенов",
      "username": "AndySem",
      "email": "andriy.semenov@example.com",
      "address": {
        "street": "просп. Героїв Сталінграду",
        "suite": "кв. 42",
        "city": "Дніпро",
        "zipcode": "49000",
        "geo": {
          "lat": "48.4647",
          "lng": "35.0462"
        }
      },
      "phone": "056-111-2222",
      "website": "andysem.net",
      "company": {
        "name": "CodeCraft",
        "catchPhrase": "Творчість у коді",
        "bs": "інновації та переваги технологій"
      }
    },
    {
      "id": 5,
      "name": "Оксана Литвиненко",
      "username": "OksanaLit",
      "email": "oksana.litvinenko@example.com",
      "address": {
        "street": "вул. Лисенка",
        "suite": "кв. 9",
        "city": "Одеса",
        "zipcode": "65000",
        "geo": {
          "lat": "46.4825",
          "lng": "30.7233"
        }
      },
      "phone": "048-555-9999",
      "website": "oksanalit.com",
      "company": {
        "name": "WebWave",
        "catchPhrase": "Створюємо світ у Вебі",
        "bs": "творчість та інновації"
      }
    },
    {
      "id": 6,
      "name": "Віталій Сидоренко",
      "username": "Vitalik",
      "email": "vitaliy.sydorenko@example.com",
      "address": {
        "street": "вул. Глибока",
        "suite": "кв. 18",
        "city": "Івано-Франківськ",
        "zipcode": "76000",
        "geo": {
          "lat": "48.9226",
          "lng": "24.7111"
        }
      },
      "phone": "034-333-4444",
      "website": "vitalik.com",
      "company": {
        "name": "InnoTech",
        "catchPhrase": "Інновації та технології",
        "bs": "розвиток та прогрес"
      }
    },
    {
      "id": 7,
      "name": "Марина Шевченко",
      "username": "MarinaS",
      "email": "marina.shevchenko@example.com",
      "address": {
        "street": "вул. Шевцова",
        "suite": "кв. 5",
        "city": "Запоріжжя",
        "zipcode": "69000",
        "geo": {
          "lat": "47.8388",
          "lng": "35.1396"
        }
      },
      "phone": "061-777-8888",
      "website": "marinas.ua",
      "company": {
        "name": "WebMaster",
        "catchPhrase": "Творчість та дизайн у Вебі",
        "bs": "індивідуальний підхід та професіоналізм"
      }
    },
    {
      "id": 8,
      "name": "Максим Іванов",
      "username": "MaxIvan",
      "email": "maxim.ivanov@example.com",
      "address": {
        "street": "вул. Пролісок",
        "suite": "кв. 12",
        "city": "Чернівці",
        "zipcode": "58000",
        "geo": {
          "lat": "48.2925",
          "lng": "25.9403"
        }
      },
      "phone": "037-444-5555",
      "website": "maxivan.net",
      "company": {
        "name": "TechWave",
        "catchPhrase": "Інновації у технологіях",
        "bs": "зростання та розвиток"
      }
    },
    {
      "id": 9,
      "name": "Світлана Григоренко",
      "username": "SvitlanaG",
      "email": "svitlana.grigorenko@example.com",
      "address": {
        "street": "вул. Гайдамацька",
        "suite": "кв. 6",
        "city": "Черкаси",
        "zipcode": "18000",
        "geo": {
          "lat": "49.4304",
          "lng": "32.0704"
        }
      },
      "phone": "047-999-0000",
      "website": "svitlanag.ua",
      "company": {
        "name": "InnoWeb",
        "catchPhrase": "Технології у Вебі",
        "bs": "творчість та ефективність"
      }
    },
    {
      "id": 10,
      "name": "Ігор Кравченко",
      "username": "IgorK",
      "email": "igor.kravchenko@example.com",
      "address": {
        "street": "вул. Шевченка",
        "suite": "кв. 25",
        "city": "Луцьк",
        "zipcode": "43000",
        "geo": {
          "lat": "50.7472",
          "lng": "25.3254"
        }
      },
      "phone": "033-222-1111",
      "website": "igork.com",
      "company": {
        "name": "CodeInnovate",
        "catchPhrase": "Інновації у кодуванні",
        "bs": "творчість та винаходи"
      }
    }
  ]
}
